Tests/NonFunctional/results/transaction_throughput_20260108_012730.log
2026-01-08 01:27:32,628 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: protocol=https
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: domain=caulong365.store
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: port=443
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: base_url=https://caulong365.store
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: tps=10
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: duration=60
2026-01-08 01:27:32,637 INFO o.a.j.JMeter: Setting JMeter property: ramp_up=10
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: Version 5.6.3
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: java.version=21.0.9
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: os.name=Mac OS X
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: os.arch=aarch64
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: os.version=26.2
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: java.awt.headless=true
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: Max memory     =1073741824
2026-01-08 01:27:32,639 INFO o.a.j.JMeter: Available Processors =10
2026-01-08 01:27:32,643 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-01-08 01:27:32,643 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-01-08 01:27:32,643 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2026-01-08 01:27:32,643 INFO o.a.j.JMeter: user.dir  =/Users/dotritrong/Desktop/Capstone/Badminton_Court_Management_System/Tests/NonFunctional
2026-01-08 01:27:32,643 INFO o.a.j.JMeter: PWD       =/Users/dotritrong/Desktop/Capstone/Badminton_Court_Management_System/Tests/NonFunctional
2026-01-08 01:27:32,645 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: PARK-3.local FullName: localhost
2026-01-08 01:27:32,648 INFO o.a.j.s.FileServer: Default base='/Users/dotritrong/Desktop/Capstone/Badminton_Court_Management_System/Tests/NonFunctional'
2026-01-08 01:27:32,649 INFO o.a.j.s.FileServer: Set new base='/Users/dotritrong/Desktop/Capstone/Badminton_Court_Management_System/Tests/NonFunctional'
2026-01-08 01:27:32,708 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-01-08 01:27:32,721 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-01-08 01:27:32,722 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-01-08 01:27:32,723 INFO o.a.j.s.SaveService: Loading file: NFT_QA_07_TransactionThroughput.jmx
2026-01-08 01:27:32,740 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2026-01-08 01:27:32,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-08 01:27:32,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-08 01:27:32,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-08 01:27:32,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-01-08 01:27:32,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-01-08 01:27:32,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-01-08 01:27:32,763 INFO o.a.j.JMeter: Creating summariser <summary>
2026-01-08 01:27:32,767 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-01-08 01:27:32,767 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-01-08 01:27:32,767 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-01-08 01:27:32,769 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-01-08 01:27:32,769 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-01-08 01:27:32,788 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-01-08 01:27:32,842 INFO o.a.j.JMeter: Running test (1767810452842)
2026-01-08 01:27:32,850 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Booking Creation TPS Test
2026-01-08 01:27:32,850 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Booking Creation TPS Test.
2026-01-08 01:27:32,850 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-01-08 01:27:32,850 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=10 delayedStart=false
2026-01-08 01:27:32,854 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-01-08 01:27:32,854 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-01-08 01:27:32,879 INFO o.a.j.t.JMeterThread: Thread started: Booking Creation TPS Test 1-1
2026-01-08 01:27:32,880 INFO o.a.j.s.FileServer: Stored: court_slots.csv
2026-01-08 01:27:32,885 INFO o.a.j.s.FileServer: Stored: test_users.csv
2026-01-08 01:27:33,116 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = PARK-3.local
2026-01-08 01:27:33,118 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-01-08 01:27:33,119 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-01-08 01:27:33,119 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-01-08 01:27:33,119 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-01-08 01:27:33,119 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-01-08 01:27:33,382 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-01-08 01:27:33,385 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-01-08 01:27:33,385 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-01-08 01:27:33,483 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-01-08 01:27:33,486 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-01-08 01:27:33,486 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-01-08 01:27:33,881 INFO o.a.j.t.JMeterThread: Thread started: Booking Creation TPS Test 1-2
2026-01-08 01:27:34,882 INFO o.a.j.t.JMeterThread: Thread started: Booking Creation TPS Test 1-3
2026-01-08 01:27:35,066 INFO o.a.j.r.Summariser: summary +      1 in 00:00:02 =    0.4/s Avg:  1909 Min:  1909 Max:  1909 Err:     1 (100.00%) Active: 3 Started: 3 Finished: 0
2026-01-08 01:27:35,882 INFO o.a.j.t.JMeterThread: Thread started: Booking Creation TPS Test 1-4
2026-01-08 01:27:36,879 INFO o.a.j.t.JMeterThread: Thread started: Booking Creation TPS Test 1-5
2026-01-08 01:27:37,004 WARN o.a.j.p.h.s.HTTPSamplerBase: Existing CookieManager HTTP Cookie Manager superseded by HTTP Cookie Manager
2026-01-08 01:27:37,344 WARN o.a.j.p.h.s.HTTPSamplerBase: Existing CookieManager HTTP Cookie Manager superseded by HTTP Cookie Manager
2026-01-08 01:27:37,701 WARN o.a.j.p.h.s.HTTPSamplerBase: Existing CookieManager HTTP Cookie Manager superseded by HTTP Cookie Manager
2026-01-08 01:27:37,879 INFO o.a.j.t.JMeterThread: Thread started: Booking Creation TPS Test 1-6
2026-01-08 01:27:37,962 WARN o.a.j.p.h.s.HTTPSamplerBase: Existing CookieManager HTTP Cookie Manager superseded by HTTP Cookie Manager
2026-01-08 01:27:38,621 INFO o.a.j.r.ResultCollector: Shutdown hook started